{"data":{"user_name":"Shivek Khurana","average_scores":{"sleep_index":{"value":65,"trend":"down"},"recovery_index":{"value":78,"trend":"down"},"movement_index":{"value":74,"trend":"up"}},"selected_week":"Aug 19 2024 - Aug 25 2024","sleep_index":{"title":"Your Sleep Index trend over the last 3 weeks","description":"The sleep index is designed to be one single metric you need to judge your sleep health, using several contributors like total sleep duration, resting HR, restfulness.","weekly_average":{"week_0":65,"week_minus_1":69,"week_minus_2":87},"insights":[{"description":"Your overall sleep index has gone down compared to the previous week. Checkout which contributors to fix and how to improve them."}],"best_contributors":[],"worst_contributors":[{"title":"Total Sleep","icon":"sleep_contributor","description":"It represents the volume of uninterrupted sleep every night for your body.","weekly_average":{"week_0":70,"week_minus_1":83,"week_minus_2":93},"insights":[{"title":"How to improve Total Sleep","description":"To improve total sleep, maintain a consistent sleep schedule and create a relaxing bedtime routine. Optimize your sleep environment by keeping it cool, dark, and quiet. Avoid screens, caffeine, and large meals before bed. Engage in regular exercise, manage stress, and limit naps to enhance sleep quality and duration."}],"average_trend":"down"},{"title":"HRV Form","icon":"hr_contributor","description":"This metric represents the HRV trend across the duration of your sleep.","weekly_average":{"week_0":60,"week_minus_1":91,"week_minus_2":84},"insights":[{"title":"How to improve HRV Form","description":"A downtrend in HRV beyond normal thresholds may indicate insufficient recovery or illness. To improve this, prioritize rest and engage in low-intensity exercise."}],"average_trend":"down"},{"title":"HR Drop","icon":"hr_contributor","description":"HR drop is defined as the time it takes for your heart rate to reach its lowest point during sleep. This marker indicates your rest and recovery quality. The earlier the drop occurs, the better your recovery and the more rested you will be.","weekly_average":{"week_0":51,"week_minus_1":72,"week_minus_2":93},"insights":[{"title":"How to improve HR Drop","description":"You can help your heart rate drop early during sleep by avoiding stimulants and physical exercise later in the day. Establishing a calming pre-sleep routine, such as reading or gentle stretching, can further promote relaxation. Winding down closer to your bedtime is a beneficial practice that increases the likelihood of your heart rate dropping early, improving overall sleep quality."}],"average_trend":"down"}]},"recovery_index":{"title":"Your Recovery Index trend over the last 3 weeks","description":"The Recovery Score indicates your overall state of 'well-being'. It depends on markers like resting heart rate, hrv, temperature, sleep quality, movement and recovery.","weekly_average":{"week_0":78,"week_minus_1":85,"week_minus_2":90},"insights":[{"description":"Your overall recovery index has gone down compared to the previous week. Checkout which contributors to fix and how to improve them."}],"best_contributors":[],"worst_contributors":[{"title":"Resting Heart Rate","icon":"hr_contributor","description":"Resting Heart Rate (RHR) is an indicator of your overall cardiovascular health and fitness level. A lower RHR typically signifies better cardiovascular fitness and efficient heart function, while a higher RHR can indicate stress, overtraining, dehydration, or potential health issues.","weekly_average":{"week_0":67,"week_minus_1":88,"week_minus_2":93},"insights":[{"title":"How to improve RHR","description":"Sleep quality plays a major role in improving heart efficiency. On days you aren’t able to get quality sleep, try a 30 min Non-sleep deep rest protocol to improve restfulness and heart efficiency."}],"average_trend":"down"},{"title":"HRV Form","icon":"hr_contributor","description":"This metric reflects your HRV patterns and variations, which indicate your body's adaptability.","weekly_average":{"week_0":68,"week_minus_1":78,"week_minus_2":81},"insights":[{"title":"How to improve HRV Form","description":"Downtrending HRV beyond normal thresholds could happen due to lack of recovery or illness. To improve this prioritize rest and low intensity exercise. "}],"average_trend":"down"},{"title":"Temperature","icon":"temp_contributor","description":"Your body temperature is an indicator of your body's state of recovery","weekly_average":{"week_0":85,"week_minus_1":96,"week_minus_2":95},"insights":[{"title":"How to improve Temperature Control","description":"Elevated temperatures can result from lack of rest, illness, or inflammation. To address this, prioritize rest and incorporate brisk walks into your routine."}],"average_trend":"down"}]},"movement_index":{"title":"Your Movement Index trend over the last 3 weeks","description":"The Movement Index is designed to keep you moving for optimal glucose metabolism and increase your non-exercise energy usage. Its a measure of how active you were that day.","weekly_average":{"week_0":74,"week_minus_1":58,"week_minus_2":49},"insights":[{"description":"Your overall movement index has improved compared to the previous week. Checkout which all contributors you can improve further."}],"best_contributors":[{"title":"Activity","icon":"time_contributor","description":"It's a measure of how much your body is working compared to when it's at rest.","weekly_average":{"week_0":100,"week_minus_1":99,"week_minus_2":94},"insights":[],"average_trend":"up"},{"title":"Workout Frequency","icon":"activity_contributor","description":"This metric tracks the number of days you were highly active and the number of workouts you completed, providing a long-term measure of your overall activity.","weekly_average":{"week_0":100,"week_minus_1":60,"week_minus_2":39},"insights":[],"average_trend":"up"},{"title":"Steps","icon":"steps_contributor","description":"This indicates the number of steps you've taken and how they compare to your usual routine.","weekly_average":{"week_0":50,"week_minus_1":2,"week_minus_2":1},"insights":[],"average_trend":"up"}],"worst_contributors":[{"title":"Active Hours","icon":"movement_contributor","description":"This measures how active you are for at least one period each hour throughout the day.","weekly_average":{"week_0":68,"week_minus_1":90,"week_minus_2":69},"insights":[{"title":"How to improve Active Hours","description":"Try to move for at least 10 minutes every hour. While the amount of movement is important, frequent activity helps improve posture and blood circulation."}],"average_trend":"down"}]},"weeks":{"week_0":{"start":"19-08-2024","end":"25-08-2024"},"week_minus_1":{"start":"12-08-2024","end":"18-08-2024"},"week_minus_2":{"start":"05-08-2024","end":"11-08-2024"}}},"error":null,"status":"ok"}