{"data":{"user_name":"Shivek Khurana","average_scores":{"sleep_index":{"value":65,"trend":"down"},"recovery_index":{"value":61,"trend":"down"},"movement_index":{"value":58,"trend":"up"}},"selected_week":"Feb 24 2025 - Mar 02 2025","sleep_index":{"title":"Your Sleep Index trend over the last 3 weeks","description":"The sleep index is designed to be one single metric you need to judge your sleep health, using several contributors like total sleep duration, resting HR, restfulness.","weekly_average":{"week_0":65,"week_minus_1":82,"week_minus_2":74},"insights":[{"description":"Your overall sleep index has gone down compared to the previous week. Checkout which contributors to fix and how to improve them."}],"best_contributors":[{"title":"HRV Form","icon":"hr_contributor","description":"This metric represents the HRV trend across the duration of your sleep.","weekly_average":{"week_0":92,"week_minus_1":84,"week_minus_2":62},"insights":[],"average_trend":"up"}],"worst_contributors":[{"title":"Timing","icon":"sleep_contributor","description":"This represents the adherence to your Circadian Rhythm.","weekly_average":{"week_0":61,"week_minus_1":96,"week_minus_2":59},"insights":[{"title":"How to improve Consistency","description":"Maintain a sleep ritual to improve restfulness. Popular rituals include listening to calming music, avoiding screens, making your bed, and taking a warm shower before sleep."}],"average_trend":"down"},{"title":"Total Sleep","icon":"sleep_contributor","description":"It represents the volume of uninterrupted sleep every night for your body.","weekly_average":{"week_0":73,"week_minus_1":91,"week_minus_2":97},"insights":[{"title":"How to improve Total Sleep","description":"To improve total sleep, maintain a consistent sleep schedule and create a relaxing bedtime routine. Optimize your sleep environment by keeping it cool, dark, and quiet. Avoid screens, caffeine, and large meals before bed. Engage in regular exercise, manage stress, and limit naps to enhance sleep quality and duration."}],"average_trend":"down"},{"title":"Restorative Sleep","icon":"sleep_contributor","description":"Restorative sleep measures the contributions of REM and deep sleep.","weekly_average":{"week_0":56,"week_minus_1":93,"week_minus_2":87},"insights":[{"title":"How to improve Restorative Sleep","description":"Deep sleep is the phase where it is hardest to wake up, typically occurring after 2-3 REM sessions. Ensuring your heart rate drops early in your sleep is important. To increase deep sleep, try exercising early in the day, avoiding food 3-4 hours before bed, and establishing a pre-sleep relaxation routine."}],"average_trend":"down"}]},"recovery_index":{"title":"Your Recovery Index trend over the last 3 weeks","description":"The Recovery Score indicates your overall state of 'well-being'. It depends on markers like resting heart rate, hrv, temperature, sleep quality, movement and recovery.","weekly_average":{"week_0":61,"week_minus_1":80,"week_minus_2":68},"insights":[{"description":"Your overall recovery index has gone down compared to the previous week. Check out which contributors to fix and how to improve them."}],"best_contributors":[{"title":"Resting Heart Rate","icon":"hr_contributor","description":"Resting Heart Rate (RHR) is an indicator of your overall cardiovascular health and fitness level. A lower RHR typically signifies better cardiovascular fitness and efficient heart function, while a higher RHR can indicate stress, overtraining, dehydration, or potential health issues.","weekly_average":{"week_0":76,"week_minus_1":70,"week_minus_2":62},"insights":[],"average_trend":"up"}],"worst_contributors":[{"title":"Sleep Quotient","icon":"sleep_contributor","description":"Sleep quality and duration are factored into this metric.","weekly_average":{"week_0":46,"week_minus_1":72,"week_minus_2":62},"insights":[{"title":"How to improve Sleep Quotient","description":"Enhancing your sleep environment is essential for better sleep quality. Ensure the room is at a comfortable temperature and avoid blue light exposure 2-3 hours before bedtime to promote natural melatonin production and help you fall asleep more easily."}],"average_trend":"down"},{"title":"Temperature","icon":"temp_contributor","description":"Your body temperature is an indicator of your body's state of recovery","weekly_average":{"week_0":70,"week_minus_1":98,"week_minus_2":97},"insights":[{"title":"How to improve Temperature Control","description":"Late evening workouts can lead to elevated body temperature during sleep. If this occurs frequently, consider adjusting the timing or intensity of your workouts to mitigate the issue."}],"average_trend":"down"},{"title":"HRV Form","icon":"hr_contributor","description":"This metric reflects your HRV patterns and variations, which indicate your body's adaptability.","weekly_average":{"week_0":80,"week_minus_1":93,"week_minus_2":65},"insights":[{"title":"How to improve HRV Form","description":"Downtrending HRV beyond normal thresholds could happen due to lack of recovery or illness. To improve this prioritize rest and low intensity exercise. "}],"average_trend":"down"}]},"movement_index":{"title":"Your Movement Index trend over the last 3 weeks","description":"The Movement Index is designed to keep you moving for optimal glucose metabolism and increase your non-exercise energy usage. It's a measure of how active you were that day.","weekly_average":{"week_0":58,"week_minus_1":56,"week_minus_2":55},"insights":[{"description":"Your overall movement index has improved compared to the previous week. Check out which all contributors you can improve further."}],"best_contributors":[{"title":"Workout Frequency","icon":"activity_contributor","description":"This metric tracks the number of days you were highly active and the number of workouts you completed, providing a long-term measure of your overall activity.","weekly_average":{"week_0":55,"week_minus_1":42,"week_minus_2":39},"insights":[],"average_trend":"up"}],"worst_contributors":[]},"weeks":{"week_0":{"start":"24-02-2025","end":"02-03-2025"},"week_minus_1":{"start":"17-02-2025","end":"23-02-2025"},"week_minus_2":{"start":"10-02-2025","end":"16-02-2025"}}},"error":null,"status":"ok"}